{
  "!": 0,
  "\"": 1,
  "#": 2,
  "$": 3,
  "%": 4,
  "&": 5,
  "'": 6,
  "(": 7,
  ")": 8,
  "*": 9,
  "+": 10,
  ",": 11,
  "-": 12,
  ".": 13,
  "/": 14,
  "0": 15,
  "1": 16,
  "2": 17,
  "3": 18,
  "4": 19,
  "5": 20,
  "6": 21,
  "7": 22,
  "8": 23,
  "9": 24,
  ":": 25,
  "=": 26,
  "?": 27,
  "@": 28,
  "A": 29,
  "B": 30,
  "C": 31,
  "D": 32,
  "E": 33,
  "F": 34,
  "G": 35,
  "H": 36,
  "I": 37,
  "J": 38,
  "K": 39,
  "L": 40,
  "M": 41,
  "N": 42,
  "O": 43,
  "P": 44,
  "Q": 45,
  "R": 46,
  "S": 47,
  "T": 48,
  "U": 49,
  "V": 50,
  "W": 51,
  "X": 52,
  "Y": 53,
  "Z": 54,
  "[": 55,
  "]": 56,
  "_": 57,
  "a": 58,
  "b": 59,
  "c": 60,
  "d": 61,
  "e": 62,
  "f": 63,
  "g": 64,
  "h": 65,
  "i": 66,
  "j": 67,
  "k": 68,
  "l": 69,
  "m": 70,
  "n": 71,
  "o": 72,
  "p": 73,
  "q": 74,
  "r": 75,
  "s": 76,
  "t": 77,
  "u": 78,
  "v": 79,
  "w": 80,
  "x": 81,
  "y": 82,
  "z": 83,
  "{": 84,
  "|": 85,
  "~": 86,
  "©": 87,
  "«": 88,
  "»": 89,
  "á": 90,
  "î": 91,
  "ï": 92,
  "÷": 93,
  "ក": 94,
  "ខ": 95,
  "គ": 96,
  "ឃ": 97,
  "ង": 98,
  "ច": 99,
  "ឆ": 100,
  "ជ": 101,
  "ឈ": 102,
  "ញ": 103,
  "ដ": 104,
  "ឋ": 105,
  "ឌ": 106,
  "ឍ": 107,
  "ណ": 108,
  "ត": 109,
  "ថ": 110,
  "ទ": 111,
  "ធ": 112,
  "ន": 113,
  "ប": 114,
  "ផ": 115,
  "ព": 116,
  "ភ": 117,
  "ម": 118,
  "យ": 119,
  "រ": 120,
  "ល": 121,
  "វ": 122,
  "ស": 123,
  "ហ": 124,
  "ឡ": 125,
  "អ": 126,
  "ឥ": 127,
  "ឦ": 128,
  "ឧ": 129,
  "ឪ": 130,
  "ឫ": 131,
  "ឬ": 132,
  "ឭ": 133,
  "ឮ": 134,
  "ឯ": 135,
  "ឱ": 136,
  "ឲ": 137,
  "ឳ": 138,
  "ា": 139,
  "ិ": 140,
  "ី": 141,
  "ឹ": 142,
  "ឺ": 143,
  "ុ": 144,
  "ូ": 145,
  "ួ": 146,
  "ើ": 147,
  "ឿ": 148,
  "ៀ": 149,
  "េ": 150,
  "ែ": 151,
  "ៃ": 152,
  "ោ": 153,
  "ៅ": 154,
  "ំ": 155,
  "ះ": 156,
  "ៈ": 157,
  "៉": 158,
  "៊": 159,
  "់": 160,
  "៌": 161,
  "៍": 162,
  "៎": 163,
  "៏": 164,
  "័": 165,
  "្": 166,
  "។": 167,
  "៕": 168,
  "៖": 169,
  "ៗ": 170,
  "៛": 171,
  "០": 172,
  "១": 173,
  "២": 174,
  "៣": 175,
  "៤": 176,
  "៥": 177,
  "៦": 178,
  "៧": 179,
  "៨": 180,
  "៩": 181,
  "‍": 182,
  "–": 183,
  "’": 184,
  "“": 185,
  "”": 186,
  "…": 187,
  "♀": 188,
  "️": 189,
  "：": 190,
  "🏻": 191,
  "👉": 192,
  "💐": 193,
  "😍": 194,
  "😠": 195,
  "😭": 196,
  "🙏": 197,
  "🤦": 198
}