{
  "!": 0,
  "\"": 1,
  "#": 2,
  "$": 3,
  "%": 4,
  "&": 5,
  "'": 6,
  "(": 7,
  ")": 8,
  "*": 9,
  "+": 10,
  ",": 11,
  "-": 12,
  ".": 13,
  "/": 14,
  "0": 15,
  "1": 16,
  "2": 17,
  "3": 18,
  "4": 19,
  "5": 20,
  "6": 21,
  "7": 22,
  "8": 23,
  "9": 24,
  ":": 25,
  ";": 26,
  "<": 27,
  "=": 28,
  ">": 29,
  "?": 30,
  "@": 31,
  "A": 32,
  "B": 33,
  "C": 34,
  "D": 35,
  "E": 36,
  "F": 37,
  "G": 38,
  "H": 39,
  "I": 40,
  "J": 41,
  "K": 42,
  "L": 43,
  "M": 44,
  "N": 45,
  "O": 46,
  "P": 47,
  "Q": 48,
  "R": 49,
  "S": 50,
  "T": 51,
  "U": 52,
  "V": 53,
  "W": 54,
  "X": 55,
  "Y": 56,
  "Z": 57,
  "[": 58,
  "\\": 59,
  "]": 60,
  "^": 61,
  "_": 62,
  "`": 63,
  "a": 64,
  "b": 65,
  "c": 66,
  "d": 67,
  "e": 68,
  "f": 69,
  "g": 70,
  "h": 71,
  "i": 72,
  "j": 73,
  "k": 74,
  "l": 75,
  "m": 76,
  "n": 77,
  "o": 78,
  "p": 79,
  "q": 80,
  "r": 81,
  "s": 82,
  "t": 83,
  "u": 84,
  "v": 85,
  "w": 86,
  "x": 87,
  "y": 88,
  "z": 89,
  "{": 90,
  "|": 91,
  "}": 92,
  "~": 93,
  "¥": 94,
  "©": 95,
  "«": 96,
  "¬": 97,
  "­": 98,
  "®": 99,
  "²": 100,
  "·": 101,
  "»": 102,
  "À": 103,
  "È": 104,
  "É": 105,
  "Ñ": 106,
  "Ö": 107,
  "×": 108,
  "Ý": 109,
  "à": 110,
  "á": 111,
  "ã": 112,
  "ä": 113,
  "æ": 114,
  "ç": 115,
  "è": 116,
  "é": 117,
  "ê": 118,
  "í": 119,
  "î": 120,
  "ï": 121,
  "ñ": 122,
  "ó": 123,
  "ô": 124,
  "ö": 125,
  "÷": 126,
  "ø": 127,
  "ù": 128,
  "ú": 129,
  "û": 130,
  "ü": 131,
  "ā": 132,
  "ă": 133,
  "ć": 134,
  "Č": 135,
  "į": 136,
  "Ł": 137,
  "œ": 138,
  "š": 139,
  "ũ": 140,
  "ū": 141,
  "ư": 142,
  "μ": 143,
  "В": 144,
  "М": 145,
  "Н": 146,
  "Р": 147,
  "а": 148,
  "б": 149,
  "в": 150,
  "г": 151,
  "д": 152,
  "е": 153,
  "ж": 154,
  "з": 155,
  "и": 156,
  "к": 157,
  "л": 158,
  "м": 159,
  "н": 160,
  "о": 161,
  "п": 162,
  "р": 163,
  "с": 164,
  "т": 165,
  "у": 166,
  "х": 167,
  "ц": 168,
  "ч": 169,
  "ш": 170,
  "щ": 171,
  "ы": 172,
  "ь": 173,
  "э": 174,
  "ю": 175,
  "я": 176,
  "ก": 177,
  "ข": 178,
  "ค": 179,
  "ง": 180,
  "จ": 181,
  "ช": 182,
  "ซ": 183,
  "ณ": 184,
  "ด": 185,
  "ต": 186,
  "ถ": 187,
  "ท": 188,
  "น": 189,
  "บ": 190,
  "ป": 191,
  "ฟ": 192,
  "ม": 193,
  "ย": 194,
  "ร": 195,
  "ล": 196,
  "ว": 197,
  "ส": 198,
  "ห": 199,
  "อ": 200,
  "ะ": 201,
  "ั": 202,
  "า": 203,
  "ิ": 204,
  "ี": 205,
  "ึ": 206,
  "ื": 207,
  "ุ": 208,
  "ู": 209,
  "เ": 210,
  "แ": 211,
  "โ": 212,
  "ใ": 213,
  "ไ": 214,
  "ๆ": 215,
  "็": 216,
  "่": 217,
  "้": 218,
  "๊": 219,
  "์": 220,
  "ក": 221,
  "ខ": 222,
  "គ": 223,
  "ឃ": 224,
  "ង": 225,
  "ច": 226,
  "ឆ": 227,
  "ជ": 228,
  "ឈ": 229,
  "ញ": 230,
  "ដ": 231,
  "ឋ": 232,
  "ឌ": 233,
  "ឍ": 234,
  "ណ": 235,
  "ត": 236,
  "ថ": 237,
  "ទ": 238,
  "ធ": 239,
  "ន": 240,
  "ប": 241,
  "ផ": 242,
  "ព": 243,
  "ភ": 244,
  "ម": 245,
  "យ": 246,
  "រ": 247,
  "ល": 248,
  "វ": 249,
  "ឝ": 250,
  "ស": 251,
  "ហ": 252,
  "ឡ": 253,
  "អ": 254,
  "ឥ": 255,
  "ឦ": 256,
  "ឧ": 257,
  "ឩ": 258,
  "ឪ": 259,
  "ឫ": 260,
  "ឬ": 261,
  "ឭ": 262,
  "ឮ": 263,
  "ឯ": 264,
  "ឰ": 265,
  "ឱ": 266,
  "ឲ": 267,
  "ឳ": 268,
  "ា": 269,
  "ិ": 270,
  "ី": 271,
  "ឹ": 272,
  "ឺ": 273,
  "ុ": 274,
  "ូ": 275,
  "ួ": 276,
  "ើ": 277,
  "ឿ": 278,
  "ៀ": 279,
  "េ": 280,
  "ែ": 281,
  "ៃ": 282,
  "ោ": 283,
  "ៅ": 284,
  "ំ": 285,
  "ះ": 286,
  "ៈ": 287,
  "៉": 288,
  "៊": 289,
  "់": 290,
  "៌": 291,
  "៍": 292,
  "៎": 293,
  "៏": 294,
  "័": 295,
  "៑": 296,
  "្": 297,
  "។": 298,
  "៕": 299,
  "៖": 300,
  "ៗ": 301,
  "៘": 302,
  "៛": 303,
  "០": 304,
  "១": 305,
  "២": 306,
  "៣": 307,
  "៤": 308,
  "៥": 309,
  "៦": 310,
  "៧": 311,
  "៨": 312,
  "៩": 313,
  "ầ": 314,
  "ế": 315,
  "ố": 316,
  "ợ": 317,
  "‌": 318,
  "‍": 319,
  "–": 320,
  "—": 321,
  "‘": 322,
  "’": 323,
  "“": 324,
  "”": 325,
  "…": 326,
  "‬": 327,
  "‭": 328,
  "″": 329,
  "⁣": 330,
  "€": 331,
  "№": 332,
  "™": 333,
  "→": 334,
  "⋆": 335,
  "■": 336,
  "●": 337,
  "☎": 338,
  "☞": 339,
  "☹": 340,
  "☺": 341,
  "♀": 342,
  "♂": 343,
  "♥": 344,
  "❌": 345,
  "❤": 346,
  "《": 347,
  "》": 348,
  "い": 349,
  "ぎ": 350,
  "こ": 351,
  "す": 352,
  "た": 353,
  "つ": 354,
  "な": 355,
  "に": 356,
  "の": 357,
  "は": 358,
  "や": 359,
  "り": 360,
  "る": 361,
  "れ": 362,
  "を": 363,
  "ゲ": 364,
  "ム": 365,
  "ー": 366,
  "供": 367,
  "全": 368,
  "国": 369,
  "子": 370,
  "持": 371,
  "時": 372,
  "目": 373,
  "線": 374,
  "親": 375,
  "言": 376,
  "長": 377,
  "間": 378,
  "": 379,
  "️": 380,
  "﻿": 381,
  "％": 382,
  "：": 383,
  "🇦": 384,
  "🇭": 385,
  "🇰": 386,
  "🇱": 387,
  "🌱": 388,
  "🌴": 389,
  "🏻": 390,
  "🏼": 391,
  "🏽": 392,
  "👇": 393,
  "👉": 394,
  "👌": 395,
  "👎": 396,
  "👏": 397,
  "👩": 398,
  "👵": 399,
  "💐": 400,
  "💔": 401,
  "💚": 402,
  "💢": 403,
  "💪": 404,
  "📌": 405,
  "😂": 406,
  "😅": 407,
  "😉": 408,
  "😋": 409,
  "😌": 410,
  "😍": 411,
  "😎": 412,
  "😓": 413,
  "😔": 414,
  "😘": 415,
  "😜": 416,
  "😝": 417,
  "😠": 418,
  "😢": 419,
  "😤": 420,
  "😥": 421,
  "😪": 422,
  "😭": 423,
  "😰": 424,
  "🙂": 425,
  "🙄": 426,
  "🙏": 427,
  "🚨": 428,
  "🤒": 429,
  "🤦": 430,
  "🤮": 431,
  "🤷": 432,
  "🥰": 433,
  "🥺": 434,
  "🦰": 435,
  "🧠": 436
}